Autodesk.Revit.DB.GroupSet
An set that contains groups.

Autodesk.Revit.DB.GroupSet.Insert(Autodesk.Revit.DB.Group)
System.Int32
Insert the specified group into the set.
item: The group to be inserted into the set.
Returns: Returns whether the group was inserted into the set.

Autodesk.Revit.DB.GroupSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.GroupSet.ReverseIterator
Autodesk.Revit.DB.GroupSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.GroupSet.ForwardIterator
Autodesk.Revit.DB.GroupSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.GroupSet.Erase(Autodesk.Revit.DB.Group)
System.Int32
Removes a specified group from the set.
item: The group to be erased.
Returns: The number of groups that were erased from the set.

Autodesk.Revit.DB.GroupSet.Contains(Autodesk.Revit.DB.Group)
System.Boolean
Tests for the existence of a group within the set.
item: The group to be searched for.
Returns: The Contains method returns True if the group is within the set, otherwise False.

Autodesk.Revit.DB.GroupSet.Clear
void
Removes every group from the set, rendering it empty.

Autodesk.Revit.DB.GroupSet.Size
System.Int32
get
Returns the number of groups that are in the set.

Autodesk.Revit.DB.GroupSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.